""" 10 Перевод и расширение словаря

Напишите программу, которая
- позволяет пользователю вводить английские слова
- и получать их перевод на русский из словаря.

 Если слово отсутствует в словаре, программа должна выводить сообщение "Перевод отсутствует".

В конце программа должна предложить пользователю добавить новые слова в словарь.
Данные:
english_words = {
    "Butterfly": "Бабочка",
    "Training": "Обучение",
    "Restaurant": "Ресторан",
    "Programming": "Программирование",
}

Пример вывода:
Введите слово на английском (или 'exit' для выхода): Butterfly
Перевод: Бабочка

Введите слово на английском (или 'exit' для выхода): Travel
Перевод отсутствует.
Хотите добавить перевод? (да/нет): да
Введите перевод для слова "Travel": Путешествие
Слово "Travel" добавлено в словарь.

Введите слово на английском (или 'exit' для выхода): exit
Программа завершена.
"""

english_words = {
    "Butterfly": "Бабочка",
    "Training": "Обучение",
    "Restaurant": "Ресторан",
    "Programming": "Программирование",
}
while True:

    word = input("Введите слово на английском (или 'exit' для выхода): ")

    if word == "exit":
        print("Программа завершена.")
        break

    if word in english_words:

        print("Перевод:", english_words[word])

    else:
        print("Перевод отсутствует.")

        answer = input("Хотите добавить перевод? (да/нет): ")

        if answer == "да":

            translation = input(f'Введите перевод для слова "{word}": ')

            english_words[word] = translation
        print(f'Слово "{word}" добавлено в словарь.')
