""" 01 Числа кратные 3 или 5

Напишите программу, которая
- создает множество из чисел, фильтруя (отбрасывая) элементы, не кратные 3 или 5.

Данные:
numbers = [16, 18, 1, 6, 3, 2, 6, 2, 14, 3, 20, 15, 19, 4, 18, 15, 15, 4, 20, 18]

Пример вывода:
{3, 6, 15, 18, 20}
"""

numbers = [16, 18, 1, 6, 3, 2, 6, 2, 14, 3, 20, 15, 19, 4, 18, 15, 15, 4, 20, 17]

result = set()

for num in numbers:
    if num % 3 == 0 or num % 5 == 0:
        result.add(num)
print(result)
# result = {num for num in numbers if num % 3 == 0 or num % 5 == 0}
