""" 08 Оценки студентов
Дан список студентов, где
- каждый элемент — это тюпл с именем студента и списком его оценок.

Программа должна
- вывести их имена
- и средний балл в виде таблицы.
- Используйте форматирование для выравнивания колонок.

Данные:
students = [
    ("Alice", [85, 90, 78]),
    ("Bob", [88, 76, 92]),
    ("Charlie", [90, 87, 85]),
    ("Diana", [72, 80, 65])
]

Пример вывода:
Имя       Средний балл
Alice            84.33
Bob              85.33
Charlie          87.33
Diana            72.33
"""

students = [
    ("Alice", [85, 90, 78]),
    ("Bob", [88, 76, 92]),
    ("Charlie", [90, 87, 85]),
    ("Diana", [72, 80, 65])
]
