# Количество символов
# Напишите программу, которая подсчитывает количество вхождений
# всех символов в строке. Нужно вывести только символы, которые
# встречаются более 1 раза (игнорируя регистр), с указанием их
# количества. Выводите повторяющиеся символы только один раз.
# text = "Programming in python"

# Пример вывода:
#
# Строка: Programming in python
#
# Символ 'p' встречается 2 раз(а)
#
# Символ 'r' встречается 2 раз(а)
#
# Символ 'o' встречается 2 раз(а)
#
# Символ 'g' встречается 2 раз(а)
#
# Символ 'm' встречается 2 раз(а)
#
# Символ 'i' встречается 2 раз(а)
#
# Символ 'n' встречается 3 раз(а)
#
# Символ ' ' встречается 2 раз(а)

text = "Programming in python"
print("Строка:", text)

text_lower = text.lower()
used = ""

for ch in text_lower:
    if ch not in used:
        count = text_lower.count(ch)
        if count > 1:
            print("Символ '" + ch + "' встречается " + str(count) + " раз(а)")
        used += ch
